[
  {
    "name": "Seoul National University Hospital",
    "latitude": 37.5795427,
    "longitude": 126.99906019999999,
    "google_place_id": "ChIJfwBmf0GjfDUR6fEUA7Zw-mk",
    "category": "hospital",
    "reviews": [
      {
        "author": "C***h",
        "content": "Pleasantly surprised by the vibe!",
        "rating": 4,
        "date": "02/03/2026 13:37:09"
      },
      {
        "author": "ซ***ว",
        "content": "Vibe above and beyond!",
        "rating": 4,
        "date": "01/24/2026 22:20:43"
      },
      {
        "author": "s***y",
        "content": "Staff has zero flaws.",
        "rating": 4,
        "date": "11/22/2025 11:26:58"
      },
      {
        "author": "M***m",
        "content": "I'm a regular advocate.",
        "rating": 3,
        "date": "10/20/2025 01:22:07"
      },
      {
        "author": "J***y",
        "content": "Certified Delusional Staff. Waited over 8 hours in the emergency room waiting area and the nurse tended to me the whole time. Then later the next day, she came in for another shift, I mentioned to that same nurse that I was in the ER waiting area for over 8 hours, and to my surprise she replied \"No you weren't\" Straight Delusional. I was there, you were there, crazy. Then when it was time to pay they told me they don't accept United Healthcare Global. I showed them the SNUH Hangul document (\"their own policy\") stating that the hospital had an agreement to accept United Healthcare Global. Then the staff said \"no\", and after I replied with (\"why don't you honor your own policies and contractual agreements\") they gave me a mean look as though I am the bad and mean person for pointing out their owndishonesty and Delusional behavior, it's like \"oh right a blatant and rude pointing out of the facts\". And I am sure someone perhaps even the staff will read this and think \"no, that didn't happen like that\" and I would say that opinion is consistent with the historical norms of delusion that I observed at that place, and that I'm neither surprised nor impressed. And that's facts.",
        "rating": 1,
        "date": "09/12/2025 10:43:54"
      },
      {
        "author": "E***E",
        "content": "I don't want to be part of your research and you are supposed to clarify the doctor's specialty before entering  for chest pain only and she didnt help she wanted evrey thing for her to start her  Her research  and she was recoding and She was recording and violating a patient's right. and I also asked for payment in dollars before entering but you want to use me for your research without my permission!? By what right do you have to get out of my life? I do not want and I did not allow and I will not allow until the day I die to be used as a medical research tool or experiments. Do not put your pharmaceutical experiments in my medications or even my food or vitamins. Stay away from me and my life. Where is the patient privacy right in this hospital",
        "rating": 1,
        "date": "07/30/2025 12:26:03"
      },
      {
        "author": "***",
        "content": "C’est une honte !\nJe viens pour mon bébé en urgence on me montre des tarifs pour les personnes étrangères qui sont très très chère ( du vol clairement) et au final on me fait payer le double de ce qui était prévu donc 1200€.\nC’est de la malhonnêteté de plus que l’infirmière ne sait même pas faire de prise de sang elle s’y est reprise 6 fois sur mon bébé à la main et au pied! Et au final on sait même pas me dire ce que mon bébé a.\nJe mets une étoile car 0 n’est pas possible mais franchement FUIYEZ , une honte je n’ai jamais vu ça c’est des gros escrocs.",
        "rating": 1,
        "date": "07/06/2025 21:56:25"
      },
      {
        "author": "J***o",
        "content": "One Sunday, I went to the nearby Seoul National University Hospital because I had had a bladder infection for 2 days, which unfortunately got worse, so I was peeing pure blood every 10 minutes. I was sent to the emergency room, where the first thing I was given was a letter. In it, I was informed that the admission alone would cost me 700,000 won (approx. 500$) and further stab dart treatments another 1,000,000 won (approx. 700$)!!!! This is an absolute rip-off and exploitation of foreigners!!! Since my life didn't depend on it, I left the hospital again, endured the pain and waited for Monday until everything was open again. I then went to a specialist. There I paid a total of about 20$ for the examination AND the medication! That bears no relation to what the hospital charged! If your life doesn't depend on it, don't go to this hospital and don't support this discrimination.",
        "rating": 1,
        "date": "05/22/2025 04:15:37"
      },
      {
        "author": "L***a",
        "content": "THE BEST HOSPITAL! THANKS to the doctor and all the staff who take care my daughter. Many blessings. 🙌",
        "rating": 5,
        "date": "04/09/2025 16:11:11"
      },
      {
        "author": "P***n",
        "content": "Very nice hospital. My brother was born here and everyone was so nice. They treated my mom very well and she said it was a good hospital which she was nervous about since we’re American and have never been to a hospital in another country.",
        "rating": 5,
        "date": "03/13/2025 19:37:05"
      },
      {
        "author": "T***o",
        "content": "Awful emergency room experience as a foreigner; one star is generous. Horrendous wait, only to have my concerns utterly dismissed by the rudest doctor I have ever spoken to, and that says a lot coming from the United States. I made the mistake of going back, and they refused to admit me as I wasn’t actively dying, despite having a referral for suspected pulmonary embolism following a 15-hour flight and elevated D-dimer levels. Don’t make the same mistake as me. Go to the nearby Seoul Red Cross Hospital instead - far quicker, cheaper, and has doctors who genuinely care about your health.",
        "rating": 1,
        "date": "09/02/2024 09:12:57"
      },
      {
        "author": "D***g",
        "content": "Going to Seoul National University Hospital is a nightmare. My loved one had to go to the A&E as she had an allergy attack. This could be dangerous as there was very bad swelling around the ENT, and could result in choking and suffocating if not seen to quickly.\n\nIf the situation wasn't so dire, we would definitely have sat down, take some time to find the hospital that is best for foreigners and even take a longer time to travel to that preferred hospital.\n\nHowever, the situation was dire, Seoul National University Hospital being the known top hospital in Seoul and 10 mins away from us, was, at that time, the best choice.\n\nThe nurses were ok, they were very friendly, patient and willing to help us, they even spoke English to us immediately after knowing we're foreigners. However, this wasnt the case when we spoke to the doctor (Lee Si Hyoung), he was extremely rude and unprofessional.\n\nWhen we entered the room, I asked \"Sorry, can you speak English?\" and he simply replied \"Korean\". The room then just went silent for 2 minutes while my loved one is suffering.\n\nThe doctor then sighed many times letting us know his frustration, and spoke to us in full Korean, as though we were Korean natives. We tried to reply in our limited Korean words.\n\nThis is when the doctor finally started to spoke in English, and we were wildly surprised as he actually seemed to be able to speak in decent English because dude was actually grammatically sound. We then finally got our treatment and he did resolve our issue. But it was so traumatic as an experience to reach this point of resolution. We do not understand why we were treated unfairly, despite the Hippocratic Oath.\n\nIt's not as if we were rude to him, we went in the consultation room when the body language and attitude that we needed help. My loved one's eyes were so swollen that she could not open her eyes, and her cheeks were swelled up so badly.\n\nWe didn't need a very complex level of English, just a basic understanding like the nurses when they were assessing our condition, and we would have been fine. But the experience made us feel so helpless and we needed to be treated like dirt in order receive the medication that we needed. Lee Si Hyoung is such a rude and arrogant doctor, which doesn't seem to be keen to help patients IN AN EMERGENCY DEPARTMENT. Shame on you.",
        "rating": 1,
        "date": "05/19/2024 06:17:38"
      }
    ]
  },
  {
    "name": "Gangbuk Samsung Hospital",
    "latitude": 37.568358499999995,
    "longitude": 126.96748459999999,
    "google_place_id": "ChIJc5MmTI6ifDURIFA5TugomhQ",
    "category": "hospital",
    "reviews": [
      {
        "author": "A***s",
        "content": "For all the other foreigners like me:\nIn Korea dont go to emerengyroom with taxi. You just get registered and you wait and usually get sent home. Order a ambulance if you are really in danger bc emerencyrooms are backed in night. Contact your insurance and they usually sort it for you and book your a time. 8.30 in the morning they start to give times for people and the hospital is very good! As good as in Finland and doctors are good. I got to the doctor in hour and in next hour every test done inc BW, xray and EKG. Good work everyone and thank you!",
        "rating": 5,
        "date": "01/06/2026 06:56:56"
      },
      {
        "author": "P***l",
        "content": "Absolutely the worst ER to exist, extremely racist reception workers (when they don’t think you understand Korean and you understand it fluently) and will keep you waiting for hours in their dirty and unsanitary waiting room only to tell you they do not think you’re having an emergency worth their time to treat.\n\nDo yourself a favor and seek treatment at Seoul University Hospital.",
        "rating": 1,
        "date": "01/06/2026 00:44:17"
      },
      {
        "author": "H***i",
        "content": "I was sick during my travel in Korea. I tried this hospital as it was the closest. The staff and nurses are really nice and try to help, even though some spoke limited English, and I couldn't speak Korean at all, but they really tried by using Google Translate and other means. The doctors were really helpful. The senior doctor (Dr. Shin) in the ED department spoke English very well and explained my condition patiently. The queue was pretty fast, too; I didn't have to wait hours. Great job.",
        "rating": 5,
        "date": "10/08/2025 05:36:24"
      },
      {
        "author": "Ç***t",
        "content": "i went their emergency service with 39 degrees of fever, they told me to come back tomorrow morning. I think they are not aware what emergency service is.",
        "rating": 1,
        "date": "07/20/2025 08:53:49"
      },
      {
        "author": "S***y",
        "content": "Unpleasant experience overall. The receptionists immediately said it’s not possible to see doctors without appointment without even bother to check. And they firmly said there’s no general outpatient department which I doubt. The staffs are very unhelpful. When I reach the dermatological department, again, rude receptionist, still saying appointment is required. What irony is there’s only one or two patients. It feels like they are employed to kick patients out of the hospital. Be more professional at your job.",
        "rating": 1,
        "date": "06/07/2025 10:51:06"
      },
      {
        "author": "J***g",
        "content": "Responsive medical professionals.  Very caring.  Staff can speak English fluently and are very attentive to the needs of foreign visitors.  We had an emergency at the middle of the night and surgery was arranged immediately.  They literally saved the life of my friend.  The nurse even went far to help us on the documents needed for insurance claims.\nFirst-class hospital in Asia at a reasonable cost.",
        "rating": 5,
        "date": "12/19/2024 01:46:04"
      },
      {
        "author": "L***c",
        "content": "They seemed to be nice when I came the first time. Hospital is clean, modern and the staff is polite and efficient. Yet when I came for the second time, the doctor just told me all my results are good and I do not have a problem. I explained to him that I still have the same problem I came for, but he just asserted that the results are good and that I am healthy.\nI am also unsure what the tests I did were for. I suspect they were the same one I told the doctor I did before coming there. The only thing I came out with was a prescription with a typo which reads \"we recommend mediation\".",
        "rating": 1,
        "date": "12/09/2024 10:43:26"
      },
      {
        "author": "D***n",
        "content": "Even though the hospital was advertised its closed the emergency department is open 24/7. Some of the nurses and doctors speak English and for all the issues they resolved was priced fairly. It is a bit smaller of a location however they done very well.. keep up the great work.. :)",
        "rating": 5,
        "date": "03/27/2024 14:43:00"
      },
      {
        "author": "P***n",
        "content": "Waiting 4 hours in the ER waiting to be seen is a new record.",
        "rating": 1,
        "date": "03/01/2024 05:50:54"
      },
      {
        "author": "C***m",
        "content": "The doctor and nurse here are professional and kind, they check very much thoroughly and explain everything in details, they have no problem communicating in English. Superb👍🏻",
        "rating": 5,
        "date": "10/27/2023 05:28:13"
      },
      {
        "author": "R***B",
        "content": "Had to go to the ER here because a chicken bone got stuck in my throat. I was surprised how fast I was helped and how fast I was able to get out if the hospital. Very good! The staff was very nice. They tried to speak English for me even though I am visiting their country. The doctor spoke very good English.",
        "rating": 5,
        "date": "08/27/2023 03:24:39"
      }
    ]
  },
  {
    "name": "JONGROYONSEI MEDICAL CLINIC",
    "latitude": 37.5708188,
    "longitude": 127.0084813,
    "google_place_id": "ChIJQxfXVEmjfDURsuYMnz1Bco4",
    "category": "hospital",
    "reviews": [
      {
        "author": "L***e",
        "content": "Tres bonne clinique , le personnel est super gentil , tout particulièrement Christine Yoo qui a été vraiment adorable de A à Z et elle m’a bien conseillé! Le dermatologue a été très professionnel!\nJe recommande et je reviendrais certainement 😊",
        "rating": 5,
        "date": "09/25/2025 17:49:49"
      },
      {
        "author": "C***M",
        "content": "C est un bon   Clinic  . Autant l accueil que les soins sont top . Toute l équipe est à l écoute et bienveillance . Merci",
        "rating": 5,
        "date": "06/12/2025 05:38:27"
      },
      {
        "author": "S***s",
        "content": "Trés bon accueil de toute l'équipe que ce soit le médecin et les esthéticiennes qui se sont occupées de moi tout au long du soin/traitement. Un accompagnement en Français de la part de Christine Yoo m'a permis de comprendre étape par étape de ce qui allait être fait. Très belle vue sur les remparts de Séoul.",
        "rating": 5,
        "date": "05/03/2025 06:00:23"
      },
      {
        "author": "S***E",
        "content": "J’ai eu l’opportunité d’avoir un RDV lors de mon séjour à Séoul.\n\nUn super accueil par le personnel. Normal, c’est la Corée du Sud ! Et un grand merci à Mme Yoo, qui parle français. C’est un plus pour la clinique.\n\nJ’ai été reçue en consultation mardi dernier avec le Dr Lee, qui est très compétent et de bons conseils.\n\nLa procédure pour des injections d’acide hyaluronique c’est très bien passé.\nLes effets se voient déjà même si je suis encore un peu gonflée.\n\nUne chose est sûre : je reviendrai !\n\nEt pour le coût, c’est extrêmement moins cher qu’en France.\n\nEncore merci pour votre accueil.",
        "rating": 5,
        "date": "03/24/2025 16:57:56"
      },
      {
        "author": "G***u",
        "content": "I got fillers and botox at Jongroyonsei Medical Clinic. Before my procedures, I got to relax in a private waiting room and was brought beverages which I appreciated a lot! The doctor and nurses were extremely professional during the entire process and I would definitely recommend this place for foreigners!",
        "rating": 5,
        "date": "03/24/2025 06:36:24"
      }
    ]
  },
  {
    "name": "TongIn herbal medicine store",
    "latitude": 37.5799333,
    "longitude": 126.9694437,
    "google_place_id": "ChIJARGfwr2ifDUREQtX6FbHVJE",
    "category": "pharmacy",
    "reviews": [
      {
        "author": "F***a",
        "content": "Muy buen lugar\nEl maestro es un genio y disponible\nEs bueno venir y tomar un tea\nEl sabe que darte\nLlegue con presión alta y bloqueo de qi de hígado\nMe dio un rea y en media hora todo fluía\n\nGracias infinitas\n\nAlex",
        "rating": 5,
        "date": "08/23/2023 05:57:22"
      },
      {
        "author": "S***i",
        "content": "A must visit in the area for a taste of Korea. Rather than a visit to cafes, you may get a more authentic experience here with a cup of Ssanghwa-tang 쌍화탕. I was apprehensive about entering as there were no English signs/menu at the entrance, but I love it there.\n\n1. The lady was friendly as she manages some basic English.\n2. Ease of ordering.  Seems like there is only 1 drink on the menu, so you can't go wrong.\n3. Cosy and clean abode. It feels like you had walked into a private work room of a specialist, with 1 huge wooden table in the centre of the room to sit down for a drink and relax.\n4. Reasonable priced (5,000 krw) for a big warm stone cup. It is not a sweet drink but you can taste the mild sweetness of jujube. Some may find the drink a little bitter but it absolutely warms the body. Go Google to know more about the drink!\n5. Close to the oldest book store photo stop. This place is just diagonally opposite from the book shop.\n\nStrongly recommend for you to take the step inside to enjoy the drink and hospitality!",
        "rating": 5,
        "date": "03/19/2023 04:01:43"
      }
    ]
  },
  {
    "name": "Jongro Jeil Pharmacy",
    "latitude": 37.5710518,
    "longitude": 127.00363139999999,
    "google_place_id": "ChIJSUNhap-jfDUR9Zn2wNbn0cU",
    "category": "pharmacy",
    "reviews": [
      {
        "author": "F***r",
        "content": "Great service! They have Reju-all in stock\nat a reasonable price. PDRN original cream is cheaper than other pharmacies next to the market entrance.",
        "rating": 5,
        "date": "09/28/2025 07:53:39"
      }
    ]
  },
  {
    "name": "Jongno The Seoul Pharmacy",
    "latitude": 37.5711276,
    "longitude": 126.99955209999999,
    "google_place_id": "ChIJrfJVhwajfDURhg2kMQG5ISM",
    "category": "pharmacy",
    "reviews": [
      {
        "author": "M***g",
        "content": "The staff here is so kind. They are very knowledgeable with the products and will recommend the perfect products for you that fits you.",
        "rating": 5,
        "date": "01/15/2026 11:24:04"
      },
      {
        "author": "D***o",
        "content": "Very wonderful experience with employees being kind and very helpful with specific needs . Would recommend anytime for specific products.",
        "rating": 5,
        "date": "01/15/2026 04:35:05"
      }
    ]
  },
  {
    "name": "Insadong Sujebi",
    "latitude": 37.5740967,
    "longitude": 126.98603809999999,
    "google_place_id": "ChIJRV_Dy8KifDURgKpYPHbdobc",
    "category": "restaurant",
    "reviews": [
      {
        "author": "B***k",
        "content": "The soojaebi is good (both the normal and the spicy). They use oyster, so avoid if you don’t like seafood. The kimchi was horrible and had a chemical smell, so try it before taking a lot out. The dongdongju (traditional rice wine) was just ok. The lines can get long though.",
        "rating": 5,
        "date": "12/25/2025 12:23:35"
      },
      {
        "author": "E***n",
        "content": "This restaurant is a bit hidden in an alley. It offers sujebi, a hand-pulled dough soup.\nThe soup was delicious. We also tried their seafood pajeon. Unfortunately, that was not as tasty and a bit too oily.",
        "rating": 4,
        "date": "11/23/2025 23:32:04"
      },
      {
        "author": "G***i",
        "content": "Very special surprise for the last day in Seoul",
        "rating": 5,
        "date": "11/21/2025 04:47:21"
      },
      {
        "author": "M***g",
        "content": "Dinner at Insadong Sujebi.",
        "rating": 5,
        "date": "10/31/2025 09:47:56"
      },
      {
        "author": "K***n",
        "content": "Service was extremely polite and kind!!! Would recommend!!",
        "rating": 5,
        "date": "10/25/2025 05:16:08"
      },
      {
        "author": "R***a",
        "content": "Un restaurante de comida coreana, comimos muy bien una sopa y también un panqueque de verduras y marisco exquisito",
        "rating": 4,
        "date": "10/22/2025 02:12:01"
      },
      {
        "author": "h***s",
        "content": "Burayı nerden bulup kaybetmişim bilmiyorum ama gittik. Helal hassasiyeti olanlardanım. Ayrıca mezhep olarak da hanefiyim eşim Şafii olduğu için koredeyken onun mezhebine uydum. Çünkü korede helal sertifikalı yerlerde bile hanefinin yiyemeyeceği deniz ürünleri helal kabuk ediliyor. Burda da omletin üstünde hanefi mezhebine uymayan deniz ürünü vardı.  Benim kadar dikkat eden varsa diye yazıyorum.  Balık çorbası ve kore pankek yedik yeşil soğanlı omlet gibi gerçekten çok lezzetliydi. Sujebi balık çorbası pek damak tadımız uymasa da insanın midesini rahatlatıyor bence. Gelmek isteyenlere tavsiye ederim atmosferi gerçekten çok güzeldi korede geleneksel lokanta deneyimi tatmış olduk. Personel ingilizce bilmiyor, ama bir şekilde anlaştık.",
        "rating": 5,
        "date": "10/11/2025 12:22:47"
      },
      {
        "author": "J***o",
        "content": "Love the seafood pancake and sujebi. So good!",
        "rating": 5,
        "date": "09/29/2025 09:58:47"
      },
      {
        "author": "C***e",
        "content": "Tucked away in the tight alleyways of Insadong is this super fab sujebi restaurant.  Everything we tried was excellent.  The sujebi comes in clay pots with three types of soups - clear, spicy and perilla seed.  The perilla seed soup version is very surprising and we ended up loving this second after the spicy version.  The sujebi (hand pulled dough) pieces were smooth and thin and had good bite.  We loved the dong dong ju and the seafood pancake was also very good with just enough dough to hold the ingredients together.",
        "rating": 5,
        "date": "09/21/2025 06:41:31"
      },
      {
        "author": "S***n",
        "content": "Tasty, simple, authentic. My palate cant handle ice cold savoury food though.",
        "rating": 5,
        "date": "07/24/2025 10:59:04"
      },
      {
        "author": "F***i",
        "content": "This is a real deal, not your westernised touristy stuff top notch! Seafood pancake really good and very well priced",
        "rating": 5,
        "date": "06/03/2025 11:13:41"
      },
      {
        "author": "L***.",
        "content": "Muy buenas las sopas! La tradicional la mejor, pedimos 2 sopas y la tortilla y fue mucha comida para 2 personas... recomendamos pedir una sola sopa y la tortilla para compartir. Siempre se puede pedir un bol de arroz o tomar algún postre fuera! Estaba con mucho sabor, el kimchi picante pero buenísimo. La tortilla también, una experiencia super diferente y muy auténtica.",
        "rating": 5,
        "date": "04/26/2025 23:54:49"
      },
      {
        "author": "M***)",
        "content": "It must be excellent for most Koreans, but to me, the food was not special at all.\n\nSo many people were lining up to enter. It must be good for others.",
        "rating": 4,
        "date": "03/23/2025 07:07:02"
      },
      {
        "author": "S***w",
        "content": "The place is a short distance from the station and easy to find. Went past 1pm and there was no queue. The sujebi broth is very light. Was hoping the broth packs more flavour. The dough noodles were a little chewy which was enjoyable. Pajeon is fragrant and crispy but a little oily.",
        "rating": 4,
        "date": "02/23/2025 17:53:52"
      },
      {
        "author": "M***y",
        "content": "This restaurant has delicious Pajeon! I love to eat their sujebi during winter with my friends ❤️",
        "rating": 5,
        "date": "01/28/2025 11:31:47"
      },
      {
        "author": "L***L",
        "content": "Similar to Singapore/M’sia mee hoon kway BUT the soups are different. It was very comforting on a cold winter day. The pancake was delicious too. If I were living in Seoul I’d be coming here a lot!",
        "rating": 5,
        "date": "01/11/2025 12:46:44"
      },
      {
        "author": "T***w",
        "content": "Famous knife cut noodle - tasty & nourishing",
        "rating": 4,
        "date": "12/06/2024 14:30:28"
      }
    ]
  },
  {
    "name": "Seokparang",
    "latitude": 37.5992545,
    "longitude": 126.95884609999999,
    "google_place_id": "ChIJMS7bcKuifDURym1rgUnFSLw",
    "category": "restaurant",
    "reviews": [
      {
        "author": "A***h",
        "content": "Had high expectations but left only with a high level of disappointment.  The food was bland and where it wasn't it was overly sweet.  No serious technique and couldn't even say the ingredients were fresh. Service for the price of the meal was also mediocre if I'm being generous.  Leaning over the table, clearing dishes before we had finished, and serving dishes quickly as is they were trying to rush us out of there. Not worth the money, time, or calories.  As we left, my daughter stepped on a dry leaf.  Her comment sums up our experience succinctly - that leaf had more depth and texture than that meal.",
        "rating": 2,
        "date": "12/28/2024 05:12:50"
      },
      {
        "author": "F***h",
        "content": "Food and atmosphere was average at best. We were a party of nine.  Should have known that when we were able to get a reservation a week in advance easily that should have been an indication. For the prices that they charged I expected more.",
        "rating": 3,
        "date": "10/13/2024 00:10:10"
      },
      {
        "author": "A***e",
        "content": "Please don't get me wrong, I enjoyed Seokparang. The food is delicious, the staff are very friendly, can speak in English/Japanese/Korean, and the decor and setting is gorgeous. What's to complain? Well, it's just that they charge a very expensive premium for their food, so we have to judge them against food on the same standard as theirs. And when we do that, it sadly does not stack up well. I had to ask myself, would I award Seokparang a Michelin star in 2023, and the answer would be, regrettably no.\n\nOverall, it is not a bad place to eat but the food does not blow you away like a Michelin star restaurant should. It doesn't not leave you feeling like \"I want to come back\". Although, I am grateful for the experience but it is a \"one time only\" thing. For reference we ordered the most expensive course (160,000 KRW / person).",
        "rating": 3,
        "date": "10/22/2023 05:05:44"
      },
      {
        "author": "L***K",
        "content": "Amazing experience with generous portion of food. The whole restaurant was very authentic and Korean. If u hav a foreign visitor wanting to treat them with good, not disappointing experience this would be a ideal place. Only thing about the atmosphere is that even we booked through email, we did not get any notification of the group booking which was taking the whole floor space (20+ people). We were introduced to a room on side without a door so the noise couldn't be blocked at all. This could've been avoided by rescheduling considering the fine-dining experience and the price of the meal. But the staff were really friendly and we've been looked after very well in general.",
        "rating": 5,
        "date": "10/09/2023 04:54:44"
      },
      {
        "author": "A***o",
        "content": "Had King's course dinner. The food was generally ok, but the flavours were not remarkable. Thought that all would be served at one according to the picture on their homepage, but it was served as course. It did thus not have same impact as it could be when a whole table is filled. What was nice being a course was that all was freshly cooked and was served warm.\n\nThe service was ok, but maybe not on top thinking of the price of the food.\n\nThe place is a hanok, in the middle of the city. Calm place. The atmosphere could be nice, but it felt a bit dull.\n\nAll in all, fun place to try out various traditional korean food, but I would recommend to go and eat somewhere else (e.g. a nice beef) for same price.",
        "rating": 3,
        "date": "06/29/2023 05:48:12"
      }
    ]
  },
  {
    "name": "Potala Restaurant Jongno Branch",
    "latitude": 37.5683742,
    "longitude": 126.98865579999999,
    "google_place_id": "ChIJHeNvYeWifDURElPZqp4MNZk",
    "category": "restaurant",
    "reviews": [
      {
        "author": "K***g",
        "content": "Good place ,for eating inside seoul .",
        "rating": 5,
        "date": "09/04/2025 15:46:36"
      },
      {
        "author": "A***s",
        "content": "Great food, great price, great location, great decoration. What more can I say! They also have lunch sets so you can enjoy various dishes even when eating alone.\n#포탈라 #종로 #인도음식 #청계천",
        "rating": 5,
        "date": "06/20/2025 03:43:52"
      },
      {
        "author": "B***k",
        "content": "Zamówiliśmy zestaw dla 2 osób: sałatka miodowa, curry z kurczakiem, nann, kurczak tandori, pierożki i napoje. Bardzo smaczne, ciepłe, krótki czas oczekiwania. Całość 50 00, czyli około 130 zł",
        "rating": 5,
        "date": "04/30/2025 14:22:49"
      },
      {
        "author": "I***g",
        "content": "‼️‼️ For real Tibetans people  ! Never visit this Tibetan restaurant in Seoul. You don’t really get proper Tibetan foods. Momo’s taste terrible because they using lots of Masala’s . Chefs are Nepali , they isn’t any Tibetan at all in this restaurant . Tibetan who visit Seoul just avoid this Restaurant .  Nothing taste like Tibetan kitchen . Felt pitty and sad to visit this Restaurant in Seoul",
        "rating": 1,
        "date": "03/25/2025 21:30:43"
      },
      {
        "author": "B***s",
        "content": "Amazing restaurant! The momos are so delicious 😋\n\nAlso, FREE TIBET!!! 自由西藏",
        "rating": 5,
        "date": "02/16/2025 07:05:04"
      },
      {
        "author": "R***i",
        "content": "We had a dine in here today, and the nepali food was amazing. The ambience was also great. Veg Sandeko was beyond the world, a must try.",
        "rating": 5,
        "date": "01/09/2025 12:50:54"
      },
      {
        "author": "T***s",
        "content": "Very disappointing food. I had the vegetable momo soup. While the menu picture had shown a rather clear soup with various, especially dark green vegetables, we got an opaque white, i.e. excessively starchy soup, and vegetables consisted mostly of cabbage with a few carrots and a few pieces of tomato that were totally overcooked. The filling of the momos were similarly starchy and surprisingly spicy. My friend ordered a paneer masala that appeared watery and stretched with starch. All in all I felt like the food was of very poor quality and lacked taste. It wasn't that cheap, either, to justify the poor quality. Service also was quite surly, not improving the experience either.",
        "rating": 2,
        "date": "01/04/2025 12:41:22"
      },
      {
        "author": "F***S",
        "content": "Unfortunately very low quality - had the butter paneer which‘s sauce tasted like it was stretched with wheat flour",
        "rating": 2,
        "date": "01/04/2025 12:36:50"
      },
      {
        "author": "G***k",
        "content": "really love coming here each time i visit seoul! amazing food, chai and more.",
        "rating": 5,
        "date": "12/14/2024 03:01:42"
      },
      {
        "author": "T***e",
        "content": "Scenic beauty inside restuarant, surrounded with the Tibetan homeland energy. Recommended to dine with 2 or more number of friends. Cuisines: Tibetan, indian and Nepali cuisine",
        "rating": 5,
        "date": "10/17/2024 07:10:11"
      },
      {
        "author": "J***F",
        "content": "Nice place with very good Indian and Nepali food.",
        "rating": 4,
        "date": "10/16/2024 14:57:58"
      },
      {
        "author": "N***i",
        "content": "No proper prayer place",
        "rating": 3,
        "date": "09/17/2024 21:42:44"
      },
      {
        "author": "L***r",
        "content": "The food not that good quality but tasteful. The fried chicken flour is more than the flesh. The butter chicken is not much but the gravy is good. The yellow rice is a bit oily. Not that highly recommended",
        "rating": 3,
        "date": "09/03/2024 10:43:24"
      },
      {
        "author": "M***z",
        "content": "Amazing place if you are a vegan. The service is very kind, and they will customize your meals so they don't have any animal products. The atmosphere is great, the restaurant is ornamented with Tibetan art and has a relaxing vibe. Thank you Potala Restaurant!",
        "rating": 5,
        "date": "09/03/2024 04:25:05"
      },
      {
        "author": "N***n",
        "content": "Les plats ne sont pas à la hauteur du décor.\nEt l amabilité n est pas au RDV\nLes samousas sont bons. Par contre les 2 soupes noodles sont fades et sans saveur. Le poulet tandoori est trop salé. Bref une déception.",
        "rating": 1,
        "date": "08/18/2024 10:36:40"
      },
      {
        "author": "P***.",
        "content": "Le riz biryani légumes n'avait vraiment pas beaucoup de goût par rapport à ce que j'ai déjà mangé en Inde ou en France. Et le nan ne semblait pas frais (très sec). Mais le service était rapide, la bière bien fraîche et le prix raisonnable. Un bon point pour les pickles à l'apéritif.",
        "rating": 3,
        "date": "07/07/2024 06:06:56"
      },
      {
        "author": "P***y",
        "content": "Not a satisfying experience. The food was not upto the mark and price was high. However, someone recommended to go this restaurant, but the food was not what expected.",
        "rating": 2,
        "date": "07/05/2024 11:55:58"
      },
      {
        "author": "M***S",
        "content": "If you offer naan with a paneer you should disclose it’s an extra 3,500 won…",
        "rating": 3,
        "date": "06/28/2024 13:16:05"
      },
      {
        "author": "S***x",
        "content": "Liegt im Keller nicht täuschen lassen.\nDie Küche ist richtig gut 👍",
        "rating": 5,
        "date": "05/28/2024 10:49:17"
      },
      {
        "author": "D***l",
        "content": "Great tibetian, Indian and Nepalese food.",
        "rating": 5,
        "date": "05/28/2024 08:57:03"
      },
      {
        "author": "T***k",
        "content": "Excellent food and friendly staff. Most definitely recommend if you’re in town.",
        "rating": 5,
        "date": "03/27/2024 06:24:41"
      },
      {
        "author": "R***r",
        "content": "Delicious vegetable curry set lunch.",
        "rating": 5,
        "date": "03/26/2024 02:46:21"
      },
      {
        "author": "J***F",
        "content": "this is a hidden gem in jongno\n\nif you want to experience good indian and nepalese food with a great aesthetic, then this is a good place to go.",
        "rating": 5,
        "date": "03/08/2024 10:53:44"
      },
      {
        "author": "A***R",
        "content": "The Good:\n- Indian/Tibetan/Nepali dishes\n- Average Prices\n- Authentic decor\n- Halal certified\n\nThe Not So Good:\n- Indian rice was not basmati and tasted more like an east asian rice\n- Dumplings had an overwhelming ginger taste\n- You have to fish for the chicken in the tawa masala as there are only few small pieces",
        "rating": 3,
        "date": "02/27/2024 05:03:39"
      },
      {
        "author": "N***A",
        "content": "The services was superb, great chicken curry, not too spicy just yummy and authentic. Thin crispy naan bread to accompany it and finish it off with their tea. Simply yet marvellous",
        "rating": 5,
        "date": "02/15/2024 11:13:22"
      }
    ]
  },
  {
    "name": "Sejong Village Food Street",
    "latitude": 37.5764955,
    "longitude": 126.9720026,
    "google_place_id": "ChIJGZLaGg-jfDURMAEAPR27oKY",
    "category": "restaurant",
    "reviews": [
      {
        "author": "A***o",
        "content": "Cute little streets with lots of restaurants, unfortunately nothing right for me and my family.",
        "rating": 5,
        "date": "11/29/2025 23:38:17"
      },
      {
        "author": "K***n",
        "content": "Street with food options",
        "rating": 3,
        "date": "10/14/2025 08:24:21"
      },
      {
        "author": "J***h",
        "content": "It is very lively with many young local people coming here.\nThe food are mainly Korean food, plenty of seafood.\nCame here multiple times as my accommodation was close and tried a couple of places but the taste was just okay. The best was the grilled pork ribs in the middle area and the simple bibimbap at the main entrance opp the bakery.\nEnded up liking the steam mandu opposite this place and ate there multiple times instead.",
        "rating": 4,
        "date": "04/25/2025 14:02:33"
      },
      {
        "author": "J***r",
        "content": "Great street for food 👍",
        "rating": 5,
        "date": "12/02/2024 09:27:18"
      },
      {
        "author": "T***n",
        "content": "This street becomes crowded after 12:00 pm. It’s easy to find a place to eat around here, I also met some tourists wearing hanbok and walking around for photoshot because this place is just right next to Gyeongbukgung.",
        "rating": 5,
        "date": "11/04/2024 13:34:36"
      },
      {
        "author": "P***n",
        "content": "Boss street. Tons of restaurants. Lots of variety. Satiate your hunger.",
        "rating": 5,
        "date": "10/17/2024 21:42:03"
      },
      {
        "author": "W***h",
        "content": "Stated Thailand and Indonesian food. But the test are not",
        "rating": 3,
        "date": "10/10/2024 04:37:18"
      },
      {
        "author": "D***O",
        "content": "Sitio tradicional y muy familiar el sueño nos atendio como en casa incluso nos regalo tanto la bebida como un plato tipico para probar y superbarato...el dueño un fenomeno!",
        "rating": 5,
        "date": "07/31/2024 11:51:00"
      },
      {
        "author": "C***P",
        "content": "The street next to Gyeongbokgung Palace is a lively area with a wide array of restaurants, bars, and hanbok rental shops. It’s a great spot to explore after visiting the palace. You’ll find a variety of dining options, from traditional Korean eateries to international cuisine, catering to all tastes and preferences.\n\nThe street is also home to numerous bars where you can unwind and enjoy a drink. Additionally, there are several hanbok rental shops, making it convenient to rent traditional Korean attire for a memorable photo opportunity.\n\nOne of the best features of this street is its accessibility for tourists. Many shops and signs have pictures and English translations, making it easy to find what you’re looking for. Whether you’re searching for a specific type of food or looking to rent hanbok, navigating this street is straightforward and user-friendly.\n\nOverall, this area provides a vibrant and enjoyable experience for visitors, with plenty of options to enhance your visit to Gyeongbokgung Palace.",
        "rating": 4,
        "date": "07/30/2024 15:35:27"
      },
      {
        "author": "C***y",
        "content": "A must see and visit. Food is must as well.",
        "rating": 5,
        "date": "07/11/2024 06:54:44"
      },
      {
        "author": "R***s",
        "content": "I'm sure the restaurants there are great, but it's definitely not a street market with vendors set up, like Myeong-dong, if that's what you're looking for.",
        "rating": 3,
        "date": "07/04/2024 01:18:57"
      },
      {
        "author": "M***ê",
        "content": "Not very much food to choose. Similar food like tanghulu, bbq everywhere.",
        "rating": 4,
        "date": "05/12/2024 15:35:25"
      },
      {
        "author": "M***g",
        "content": "Great street to eat at with lots of restaurants",
        "rating": 5,
        "date": "03/26/2024 08:23:58"
      },
      {
        "author": "M***o",
        "content": "Great place to dine specially for foreigners who wants to eat authentic korean cuisine. Plenty of stores to choose from and just beside the Sekong Palace which is very convinient to visit. We went there to try the beef intestines and it was very good.\nHighly recommended!",
        "rating": 5,
        "date": "03/02/2024 12:41:00"
      }
    ]
  }
]